[{"Title": "Computer Technician", "Company": "Conduent", "Description": "You will be the one to ensure that adequate IT infrastructure is in place and is used to its maximum capabilities.As a computer technician you must be well versed in computer systems and network.."}, {"Title": "IT Repair Technician (Computer/Printer Hardware)", "Company": "Hemmersbach", "Description": "Your skills. Experience in repair of Printers and Computer. First experience working with Ticket.. You will carry out maintenance, troubleshooting and repair work on computers, notebooks, printers and.."}, {"Title": "Remote Computer Support Technician", "Company": "ASP Web Solutions", "Description": "Year minimum experience with MAC OS computer support. 3 years minimum experience supporting Mobile.. Provision and deploy computers and mobile devices. Maintains a high degree of technical knowledge in.."}, {"Title": "Support Technician - Remote", "Company": "The Computer Merchant, Ltd", "Description": "JOB TITLE Support Technician JOB LOCATION. Remote WAGE RANGE. 22 24 hr JOB NUMBER. 22 02207.. Escalate incidents (when required) to the appropriately experienced technician. Record, track, and.."}, {"Title": "Support Technician  Remote", "Company": "The Computer Merchant", "Description": "Job DescriptionJOB TITLE Support TechnicianJOB LOCATION. RemoteWAGE RANGE. 22 24 hrJOB NUMBER.. Escalate incidents (when required) to the appropriately experienced technician.Record, track, and.."}, {"Title": "Behavior Technician (paid training & tuition assistance)", "Company": "ABS Kids", "Description": "If so, then we want to talk to you about our part time Behavior Technician positions!. I love when a.. Emily M., ABS Kids Employee. Responsibilities. What would you do?. As a Behavior Technician. Registered.."}, {"Title": "Travel Surgical Technician Operating Room Tech OR Tech", "Company": "One Staff Medical", "Description": "Company Description. The Operating Room (OR) Nurse will provide care for patients before, during and after surgery. They will also, educate the patient, circulating nurse and or sc.."}, {"Title": "Pharmacy Technician (1st Shift)", "Company": "UnitedHealth Group", "Description": "Join us and start doing your lifes best work.(sm)As a Pharmacy Technician, youll be responsible for.. GEDCurrent State of North Carolina Pharmacy Technician License (PhT) or must be able to register with.."}, {"Title": "Principal Compute Engineer", "Company": "SPECTRUM", "Description": "MINIMUM QUALIFICATIONSBachelors degree in Computer Science, Engineering and or related and or equivalent work experience.Minimum eight years of experience administrating, integrating and.."}, {"Title": "Pharmacy Technician / Pharm Tech Apprenticeship", "Company": "Walgreens", "Description": "Our pharmacy technician positions have undergone an exciting transformation, moving from a transaction.. As a Walgreens Pharmacy Technician or Pharmacy Technician Apprentice, youll be front and center.."}, {"Title": "CNC Emergency Field Service Technician", "Company": "KRC Machine Tool Solutions", "Description": "Assist other service engineers, and preventive maintenance technicians. General scraping and fitting of.. Emergency Field Service TechnicianIMMEDIATE SUPERVISOR. SERVICE MANAGERTRAVEL. REQUIRED UP TO 100.."}, {"Title": "DISH Installation Technician", "Company": "DISH", "Description": "Check out our video to experience a day in the life of a DISH Technician. https. www.youtube.com watch?v.. Our installation technicians are leading the charge for better customer experience, educating and.."}, {"Title": "X Ray Technician Limited Scope $4500 sign on bonus", "Company": "Concentra", "Description": "Performs Department of Transportation and Non DOT drug and alcohol testingQualifications. Graduate of accredited program for X Ray technicians. Licensed in accordance with state of jurisdiction.."}, {"Title": "Travel Medical Lab Technician - $2,200 per week", "Company": "MedPro Healthcare Allied Staffing", "Description": "MedPro Healthcare Allied Staffing is seeking a travel Medical Lab Technician for a travel job in.. Medical Lab TechnicianDiscipline. Allied Health ProfessionalStart Date. ASAPDuration. 13 weeks40 hours.."}, {"Title": "Travel X-Ray Technician - $2,540 per week", "Company": "Therapy Staff", "Description": "Therapy Staff is seeking a travel X Ray Technician for a travel job in Charlotte, North Carolina.. X Ray TechnicianDiscipline. Allied Health ProfessionalStart Date. 08 29 2022Duration. 13 weeks40 hours.."}, {"Title": "Travel Medical Lab Technician - $1,847 per week, Nights", "Company": "OneStaff Medical", "Description": "OneStaff Medical is seeking a travel Medical Lab Technician for a travel job in Charlotte, North.. Medical Lab TechnicianDiscipline. Allied Health ProfessionalStart Date. ASAPDuration. 13 weeks36 hours.."}, {"Title": "Travel Surgical Technician - $2,232 per week", "Company": "Premier Medical Staffing", "Description": "Premier Medical Staffing is seeking a travel Surgical Technician for a travel job in Charlotte, North.. Surgical TechnicianDiscipline. Allied Health ProfessionalStart Date. 08 29 2022Duration. 13 weeks36.."}, {"Title": "Mobile  Magnetic Resonance Imaging Technician", "Company": "Novant Health", "Description": "Overview The Mobile MR Technologist travels with the mobile MR truck and assists physicians in the performance of diagnostic and. or therapeutic procedures by preparing the patient.."}, {"Title": "Behavior Technician (Charlotte Southwest Center)", "Company": "Hopebridge", "Description": "You are looking to break into ABA as a Behavior Technician, where you can make an impact and become an.. a bachelors in psychology is a huge plusCompletion of Registered Behavior Technician (RBT) Credential.."}, {"Title": "Sterile Compounding Pharmacy Technician", "Company": "KabaFusion", "Description": "Includes discounts on travel, cell phone, clothing, and more Employee Referral ProgramJOB SUMMARY The Pharmacy Technician assists the pharmacist(s) in storing, preparing, dispensing.."}, {"Title": "Diesel Mechanic/Technician", "Company": "Knight Transportation", "Description": "An in person interview, mechanic or technician assessment, lifetime background check, physical, functional capacity exam, and a drug screen (hair and urine). So, be a part of the best team in.."}, {"Title": "Dental/Denture Technician – Support", "Company": "Aspen Dental", "Description": "At Aspen Dental its not just any Dental Technician career. its a chance to work with cutting edge.. What we can offer you when you join the general practice team as a Dental Technician. Mentors devoted to.."}, {"Title": "Diesel Technician/Mechanic III - Entry Level", "Company": "Penske", "Description": "Diesel Technician Mechanic III. Entry Level (Job Number. 2214947 ) Whats the Job? Ready to accelerate.. Working alongside experienced supervisors and master technicians, well teach you about our vehicle.."}, {"Title": "Travel Radiology Technician / XRay", "Company": "HealthCare Travelers", "Description": "Travel Radiology Technician Numerous Nationwide Travel Assignments. Jobs Tired of completing an application just to get informationClick the \"View or Apply\" button for HCEN& 39 s Free, Quick.."}, {"Title": "AV Technician (Level 2) - Charlotte, NC", "Company": "INTER TECH", "Description": "AV Technician (Level 2). Charlotte, NC Department. Operations Reports To. Project Manager or Lead AV.. This position reports to the Project Manager or Lead AV Technician and is a member of the Operations.."}, {"Title": "Automotive Technician", "Company": "BMW Dealer Technician Opportunities", "Description": "Qualifications. Seeking Automotive Service Technicians and Experienced Line Technicians. (any luxury OEM.. Proficiency in basic computer skills required. Excellent Customer Service skills required. Candidate.."}]